art_share_API/app/controllers/artworks_controller.rb

    def index
        if Artwork.artworks_for_user_id(:artist_id)
            # index of nested resource
            artworks = Artwork.artworks_for_user_id(:artist_id)
            # user = User.find(:artist_id)
            # artworks = user.artworks + user.shared_artworks
            # artworks = Artwork.where(artist_id: params[:artist_id])
        else
            # index of top-level resource
            artworks = Artwork.all
        end

        # shared = Artwork.artworks_for_user_id

        # render json: artworks
        render json: artworks.distinct
---
SELECT "artworks".* FROM "artworks"
SELECT "users".* FROM "users" WHERE (viewer = artist_id)

    def destroy
        artwork = Artwork.find_by(id: params[:id])

        if artwork && artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]