art_share_API/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "peter"], ["created_at", "2023-09-27 20:23:03.692579"], ["updated_at", "2023-09-27 20:23:03.692579"]]
---
    def create
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def destroy
        user = User.find_by(id: params[:id])

        if user && user.destroy