art_share_API/app/models/artwork.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def self.artworks_for_user_id
        user = User.find_by(id: :artist_id)